# jQuery
* 자바스크립트의 가장 유명한 라이브러리 jQuery. Front-end 개발자가 가장 많이 사용했던 라이브러리로, 현재는 리엑트에 밀려 1위에서 2위로 밀려났고 앞으로 몇년간은 이 순위는 유지할 듯.
* 서로 기능을 상호보완했는데 (css 애니메이션이 없었을 때 jQuery 기능을 사용하는 등) 점차 자스 기능이 좋아졌고, jQuery도 기능을 추가하다보니 무거워짐 .업데이트 되다보면 모든 좋은 라이브러리도 비대해지는 시기가 오게 된다.

* 전체를 맞춰서 코딩하면 : framework
* 내 코드가 주가 되고, 코드를 불러온다 : library
* 뷰 : 프레임웤, 리액트 : 라이브러리, 제이쿼리 : 라이브러리, 부트스트랩: 프레임웤과 라이브러리의 중간?

```
<body>
  ...
	<script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
</body>
```

* 버전별 차이
  * jquery-1.x : 구형 브라우저 대부분 지원, 가장 안정적인 버전, 최신 버전과 호완문제가 있어 migrate를 함께 넣어주어야 합니다.
  * jquery-2.x : 익스플로러 8버전 버림, 따라서 파일 크기 감소. 9버전 이상을 호환할 것이라면 2.x를 사용할 것!
  * jquery-3.x : Promises와 ajax, when, data 등 여러 최신 플러그인과 HTML5 호환
